DataProcessors/ЗагрузкаКаталогаТоваровИзФайлаXML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКаталогаТоваровИзФайлаXML</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИдентификаторыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаКаталогаТоваровИзФайлаXML/Ext/ManagerModule.bsl
Процедура ЗагрузкаКаталогаТоваров(ДанныеФайла, ОбновлятьСуществующуюНоменклатуру) Экспорт
	
	ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла("xml");
	ДанныеФайла.Записать(ПутьКВременномуФайлу); 

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлу);
	
	ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ПутьКВременномуФайлу);
	
	//	создание групп номенклатуры
	СтруктураДанных = ИнициализироватьДанные(Ложь);
	ЗагрузитьДанныеВТаблицуЗначений(ДанныеXDTO.shop.categories.category, СтруктураДанных.СоответствиеПолей, СтруктураДанных.ТаблицаДанных, Истина);
	
	СоздатьГруппыНоменклатуры(СтруктураДанных.ТаблицаДанных);
	
	//	создание номенклатуры
	СтруктураДанных = ИнициализироватьДанные();
	ЗагрузитьДанныеВТаблицуЗначений(ДанныеXDTO.shop.offers.offer, СтруктураДанных.СоответствиеПолей, СтруктураДанных.ТаблицаДанных);
	
	СоздатьНоменклатуру(СтруктураДанных.ТаблицаДанных, ОбновлятьСуществующуюНоменклатуру);
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьДанныеВТаблицуЗначений(ДанныеXDTO, СоответствиеПолей, ТаблицаДанных, ЭтоГруппы = Ложь)
	
	Если ТипЗнч(ДанныеXDTO) = Тип("ОбъектXDTO") Тогда
		МассивГруппТоваровXDTO = Новый Массив;		
		МассивГруппТоваровXDTO.Добавить(ДанныеXDTO);
	Иначе                     
		МассивГруппТоваровXDTO = ДанныеXDTO;
	КонецЕсли;
	
	Для каждого ОбъектXDTO Из МассивГруппТоваровXDTO Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		Если ЭтоГруппы Тогда   	
			НоваяСтрока.НаименованиеГруппы = ОбъектXDTO.Последовательность().ПолучитьТекст(0);	
		КонецЕсли;		
		
		Для каждого СвойствоXDTO Из ОбъектXDTO.Свойства() Цикл
			
			ИмяСвойства = СвойствоXDTO.Имя;
			
			Если ТипЗнч(ОбъектXDTO[ИмяСвойства]) = Тип("ОбъектXDTO") Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = СоответствиеПолей.Получить(ИмяСвойства);
			Если ИмяРеквизита <> Неопределено Тогда
				НоваяСтрока[ИмяРеквизита] = ОбъектXDTO[ИмяСвойства];			
			КонецЕсли;			
		
		КонецЦикла;   	
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ИнициализироватьДанные(ЭтоНоменклатура = Истина)
	
	СоответствиеПолей	= Новый Соответствие;
	ТаблицаДанных 		= Новый ТаблицаЗначений;
	
	Если ЭтоНоменклатура Тогда   	
		
		//	Данные по номенклатуре
		СоответствиеПолей.Вставить("id",			"Идентификатор");
		СоответствиеПолей.Вставить("categoryId",	"ИдентификаторРодителя");
		СоответствиеПолей.Вставить("name",			"Наименование");	
		СоответствиеПолей.Вставить("vendorCode",	"Артикул");     
		СоответствиеПолей.Вставить("description",	"Описание");    		
		
		ТаблицаДанных.Колонки.Добавить("Идентификатор",			ОбщегоНазначения.ОписаниеТипаСтрока(36)); 
		ТаблицаДанных.Колонки.Добавить("ИдентификаторРодителя", ОбщегоНазначения.ОписаниеТипаСтрока(36));	
		ТаблицаДанных.Колонки.Добавить("Наименование", 			ОбщегоНазначения.ОписаниеТипаСтрока(100));
		ТаблицаДанных.Колонки.Добавить("Артикул", 				ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаДанных.Колонки.Добавить("Описание", 				ОбщегоНазначения.ОписаниеТипаСтрока(300));
		
	Иначе
		
		//	Данные по группам номенклатуры
		СоответствиеПолей.Вставить("id",		"Идентификатор");
		СоответствиеПолей.Вставить("parentId",	"ИдентификаторРодителя");
		
		ТаблицаДанных.Колонки.Добавить("Идентификатор", 			ОбщегоНазначения.ОписаниеТипаСтрока(36)); 
		ТаблицаДанных.Колонки.Добавить("ИдентификаторРодителя", 	ОбщегоНазначения.ОписаниеТипаСтрока(36));
		ТаблицаДанных.Колонки.Добавить("НаименованиеГруппы", 		ОбщегоНазначения.ОписаниеТипаСтрока(100));
		
	КонецЕсли; 
	
	Возврат Новый Структура("СоответствиеПолей, ТаблицаДанных", СоответствиеПолей, ТаблицаДанных);
	
КонецФункции 

&НаСервере
Процедура СоздатьГруппыНоменклатуры(ГруппыНоменклатуры)
	
	//	Соединяем с уже с созданными группами, чтобы их исключить из таблицы значений
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыНоменклатуры.Идентификатор КАК Идентификатор,
		|	ГруппыНоменклатуры.ИдентификаторРодителя КАК ИдентификаторРодителя,
		|	ГруппыНоменклатуры.НаименованиеГруппы КАК НаименованиеГруппы
		|ПОМЕСТИТЬ ВТ_ГруппыНоменклатуры
		|ИЗ
		|	&ГруппыНоменклатуры КАК ГруппыНоменклатуры
		|ГДЕ
		|	ГруппыНоменклатуры.Идентификатор <> """"
		|	И ГруппыНоменклатуры.НаименованиеГруппы <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыНоменклатуры.Идентификатор КАК Идентификатор,
		|	ГруппыНоменклатуры.ИдентификаторРодителя КАК ИдентификаторРодителя,
		|	ГруппыНоменклатуры.НаименованиеГруппы КАК НаименованиеГруппы
		|ИЗ
		|	ВТ_ГруппыНоменклатуры КАК ГруппыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
		|		ПО ГруппыНоменклатуры.Идентификатор = ИдентификаторыНоменклатуры.Идентификатор
		|ГДЕ
		|	ИдентификаторыНоменклатуры.Идентификатор ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
	
	//	Сначала создадим все группы, чтобы потом родитель точно существовал.
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл     
		
		НоменклатураОбъект = Справочники.Номенклатура.СоздатьГруппу();
		НоменклатураОбъект.Наименование = Выборка.НаименованиеГруппы;
		
		Попытка
			
			НачатьТранзакцию();
			
			НоменклатураОбъект.Записать();                              
			СсылкаНоменклатуры = НоменклатураОбъект.Ссылка;
			
			МенеджерИдентификаторовНоменклатуры = РегистрыСведений.ИдентификаторыНоменклатуры.СоздатьМенеджерЗаписи();
			МенеджерИдентификаторовНоменклатуры.Номенклатура 	= СсылкаНоменклатуры;
			МенеджерИдентификаторовНоменклатуры.Идентификатор 	= Выборка.Идентификатор;
			МенеджерИдентификаторовНоменклатуры.Записать();
		
			ЗафиксироватьТранзакцию();
			
		Исключение                                          
			
			ТекстСообщения = СтрШаблон("Не удалось создать группу ""%1""%2%3",
										Выборка.НаименованиеГруппы,
										Символы.ПС,
										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;	
		
	КонецЦикла; 
	
	//	Заполним родителя во всех группах, так как он мог измениться в уже созданных ранее группах.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыНоменклатуры.Идентификатор КАК Идентификатор,
		|	ГруппыНоменклатуры.ИдентификаторРодителя КАК ИдентификаторРодителя,
		|	ГруппыНоменклатуры.НаименованиеГруппы КАК НаименованиеГруппы
		|ПОМЕСТИТЬ ВТ_ГруппыНоменклатуры
		|ИЗ
		|	&ГруппыНоменклатуры КАК ГруппыНоменклатуры
		|ГДЕ
		|	ГруппыНоменклатуры.Идентификатор <> """"
		|	И ГруппыНоменклатуры.НаименованиеГруппы <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор,
		|	ИдентификаторРодителя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыНоменклатуры.Идентификатор КАК Идентификатор,
		|	ГруппыНоменклатуры.ИдентификаторРодителя КАК ИдентификаторРодителя,
		|	ГруппыНоменклатуры.НаименованиеГруппы КАК НаименованиеГруппы,
		|	ЕСТЬNULL(ИдентификаторыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Группа,
		|	ЕСТЬNULL(ИдентификаторыНоменклатурыДляРодителя.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Родитель,
		|	ЕСТЬNULL(ИдентификаторыНоменклатуры.Номенклатура.Родитель, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК СтарыйРодитель
		|ИЗ
		|	ВТ_ГруппыНоменклатуры КАК ГруппыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
		|		ПО ГруппыНоменклатуры.Идентификатор = ИдентификаторыНоменклатуры.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатурыДляРодителя
		|		ПО ГруппыНоменклатуры.ИдентификаторРодителя = ИдентификаторыНоменклатурыДляРодителя.Идентификатор
		|ГДЕ
		|	ЕСТЬNULL(ИдентификаторыНоменклатуры.Номенклатура.Родитель, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЕСТЬNULL(ИдентификаторыНоменклатурыДляРодителя.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|	И ЕСТЬNULL(ИдентификаторыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ЕСТЬNULL(ИдентификаторыНоменклатурыДляРодителя.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НоменклатураОбъект = Выборка.Группа.ПолучитьОбъект();
		
		Попытка
			НоменклатураОбъект.Заблокировать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось заблокировать группу ""%1""%2%3", 
								НоменклатураОбъект, Символы.ПС, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;
		
		Если НоменклатураОбъект.Заблокирован() Тогда
			
			НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
			НоменклатураОбъект.Родитель = Выборка.Родитель;
			
			Попытка                                  			
				НоменклатураОбъект.Записать();		
			Исключение 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать группу ""%1""%2%3", 
								НоменклатураОбъект, Символы.ПС, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;               
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьНоменклатуру(ТаблицаНоменклатуры, ОбновлятьСуществующуюНоменклатуру)
	
	// Исключим уже созданные товары (если не установлено ОбновлятьСуществующуюНоменклатуру) и найдем родителя
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Идентификатор КАК Идентификатор,
		|	ТаблицаНоменклатуры.ИдентификаторРодителя КАК ИдентификаторРодителя,
		|	ТаблицаНоменклатуры.Наименование КАК Наименование,
		|	ТаблицаНоменклатуры.Артикул КАК Артикул,
		|	ТаблицаНоменклатуры.Описание КАК Описание
		|ПОМЕСТИТЬ ВТ_ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|ГДЕ
		|	ТаблицаНоменклатуры.Идентификатор <> """"
		|	И ТаблицаНоменклатуры.Наименование <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор,
		|	ИдентификаторРодителя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Идентификатор КАК Идентификатор,
		|	ТаблицаНоменклатуры.ИдентификаторРодителя КАК ИдентификаторРодителя,
		|	ТаблицаНоменклатуры.Наименование КАК Наименование,
		|	ТаблицаНоменклатуры.Артикул КАК Артикул,
		|	ТаблицаНоменклатуры.Описание КАК Описание,
		|	ЕСТЬNULL(ИдентификаторыНоменклатурыРодителя.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Родитель,
		|	ЕСТЬNULL(ИдентификаторыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
		|ИЗ
		|	ВТ_ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатуры
		|		ПО ТаблицаНоменклатуры.Идентификатор = ИдентификаторыНоменклатуры.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыНоменклатуры КАК ИдентификаторыНоменклатурыРодителя
		|		ПО ТаблицаНоменклатуры.ИдентификаторРодителя = ИдентификаторыНоменклатурыРодителя.Идентификатор
		|ГДЕ
		|	(ИдентификаторыНоменклатуры.Идентификатор ЕСТЬ NULL Или &ОбновлятьСуществующуюНоменклатуру)";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("ОбновлятьСуществующуюНоменклатуру", ОбновлятьСуществующуюНоменклатуру);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок = Выборка.Количество();
	Счетчик = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда   	
			НоменклатураОбъект = Выборка.Номенклатура.ПолучитьОбъект();
		Иначе 
			НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоменклатураОбъект, Выборка);
		НоменклатураОбъект.Описание = ФорматироватьОписание(Выборка.Описание);
		
		Попытка
			
			НачатьТранзакцию();
			
			НоменклатураОбъект.Записать();                              
			
			Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда   	
				МенеджерИдентификаторовНоменклатуры = РегистрыСведений.ИдентификаторыНоменклатуры.СоздатьМенеджерЗаписи();
				МенеджерИдентификаторовНоменклатуры.Номенклатура 	= НоменклатураОбъект.Ссылка;
				МенеджерИдентификаторовНоменклатуры.Идентификатор	= Выборка.Идентификатор;
				МенеджерИдентификаторовНоменклатуры.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение                                          
			
			ТекстСообщения = СтрШаблон("Не удалось создать номенклатуру ""%1""%2%3",
										Выборка.НаименованиеГруппы,
										Символы.ПС,
										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
		Если Счетчик % 20 = 0 Тогда   	
			ДлительныеОперации.СообщитьПрогресс(Окр(100 * Счетчик / ВсегоСтрок, 0));	
		КонецЕсли;		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ФорматироватьОписание(Знач Описание)
		
	Описание = СтрЗаменить(Описание, "<br />", "");
	Описание = СтрЗаменить(Описание, "<br/>",  "");	
	
	Возврат СокрЛП(Описание);

КонецФункции
